benchmark/results/tc-pt03-listings/html-report/statistics.json
{
  "GET /api/listings" : {
    "transaction" : "GET /api/listings",
    "sampleCount" : 2038,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 259.41952894995114,
    "medianResTime" : 104.0,
    "minResTime" : 94.0,
    "maxResTime" : 5498.0,
    "pct1ResTime" : 115.0,
    "pct2ResTime" : 175.04999999999995,
    "pct3ResTime" : 5106.0,
    "throughput" : 59.11873060076001,
    "receivedKBytesPerSec" : 517.492233505207,
    "sentKBytesPerSec" : 10.276498092710238
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2038,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 259.41952894995114,
    "medianResTime" : 104.0,
    "minResTime" : 94.0,
    "maxResTime" : 5498.0,
    "pct1ResTime" : 115.0,
    "pct2ResTime" : 175.04999999999995,
    "pct3ResTime" : 5106.0,
    "throughput" : 59.11873060076001,
    "receivedKBytesPerSec" : 517.492233505207,
    "sentKBytesPerSec" : 10.276498092710238
  }
}